#### 📖 Terraform Plan ('src/common/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
                        = "1"
          + "FF_IO_SIGN_ENABLED"                              = "1"
          + "FF_IO_WALLET_ENABLED"                            = "1"
          + "FF_IO_WALLET_TRIAL_ENABLED"                      = "0"
          + "FF_IO_X_USER_TOKEN"                              = "NONE"
          + "FF_IO_X_USER_TOKEN_BETA_TESTER_SHA_LIST"         = (sensitive value)
          + "FF_IO_X_USER_TOKEN_CANARY_SHA_USERS_REGEX"       = "XYZ"
          + "FF_PN_ACTIVATION_ENABLED"                        = "1"
          + "FF_ROUTING_PUSH_NOTIF"                           = "ALL"
          + "FF_ROUTING_PUSH_NOTIF_BETA_TESTER_SHA_LIST"      = (sensitive value)
          + "FF_ROUTING_PUSH_NOTIF_CANARY_SHA_USERS_REGEX"    = "^([(0-9)|(a-f)|(A-F)]{63}[(0-4)]{1})$"
          + "FF_TRIAL_SYSTEM_ENABLED"                         = "1"
          + "FF_UNIQUE_EMAIL_ENFORCEMENT"                     = "ALL"
          + "IO_FIMS_API_BASE_PATH"                           = "/api/v1/fims"
          + "IO_FIMS_API_KEY"                                 = (sensitive value)
          + "IO_FIMS_API_URL"                                 = "https://io-p-itn-fims-user-func-01.azurewebsites.net"
          + "IO_SIGN_API_BASE_PATH"                           = "/api/v1/sign"
          + "IO_SIGN_API_KEY"                                 = (sensitive value)
          + "IO_SIGN_API_URL"                                 = "https://io-p-sign-user-func.azurewebsites.net"
          + "IO_SIGN_SERVICE_ID"                              = "01GQQZ9HF5GAPRVKJM1VDAVFHM"
          + "IO_WALLET_API_BASE_PATH"                         = "/api/v1/wallet"
          + "IO_WALLET_API_KEY"                               = (sensitive value)
          + "IO_WALLET_API_URL"                               = "https://io-p-itn-wallet-user-func-02.azurewebsites.net"
          + "IO_WALLET_TRIAL_ID"                              = "01J2GN4TA8FB6DPTAX3T3YD6M1"
          + "IO_WALLET_UAT_API_BASE_PATH"                     = "/api/v1/wallet/uat"
          + "IO_WALLET_UAT_API_KEY"                           = (sensitive value)
          + "IO_WALLET_UAT_API_URL"                           = "https://io-u-itn-wallet-user-func-01.azurewebsites.net/api/v1/wallet"
          + "JWT_SUPPORT_TOKEN_EXPIRATION"                    = "1209600"
          + "JWT_SUPPORT_TOKEN_ISSUER"                        = "app-backend.io.italia.it"
          + "JWT_SUPPORT_TOKEN_PRIVATE_RSA_KEY"               = (sensitive value)
          + "LOLLIPOP_API_BASE_PATH"                          = "/api/v1"
          + "LOLLIPOP_API_KEY"                                = (sensitive value)
          + "LOLLIPOP_API_URL"                                = "https://io-p-itn-auth-lollipop-func-02.azurewebsites.net"
          + "MYPORTAL_BASE_PATH"                              = "/myportal/api/v1"
          + "NODE_ENV"                                        = "production"
          + "NOTIFICATIONS_QUEUE_NAME"                        = "push-notifications"
          + "NOTIFICATIONS_STORAGE_CONNECTION_STRING"         = (sensitive value)
          + "PAGOPA_API_KEY_PROD"                             = (sensitive value)
          + "PAGOPA_API_KEY_UAT"                              = (sensitive value)
          + "PAGOPA_API_URL_PROD"                             = "https://api.platform.pagopa.it/checkout/auth/payments/v1"
          + "PAGOPA_API_URL_TEST"                             = "https://api.uat.platform.pagopa.it/checkout/auth/payments/v1"
          + "PAGOPA_ECOMMERCE_API_KEY"                        = (sensitive value)
          + "PAGOPA_ECOMMERCE_BASE_URL"                       = "https://api.platform.pagopa.it/ecommerce/payment-requests-service/v1"
          + "PAGOPA_ECOMMERCE_UAT_API_KEY"                    = (sensitive value)
          + "PAGOPA_ECOMMERCE_UAT_BASE_URL"                   = "https://api.uat.platform.pagopa.it/ecommerce/payment-requests-service/v1"
          + "PECSERVERS_aruba_basePath"                       = "/apigateway/api/v2/pagopa/mailbox"
          + "PECSERVERS_aruba_secret"                         = (sensitive value)
          + "PECSERVERS_aruba_serviceId"                      = "01FRMRD5P7H378MDXBBW3DTYCF"
          + "PECSERVERS_aruba_url"                            = "https://pagopa-test.pec.aruba.it"
          + "PECSERVERS_poste_basePath"                       = null
          + "PECSERVERS_poste_secret"                         = (sensitive value)
          + "PECSERVERS_poste_serviceId"                      = "01FQ4945RG5WJGPHKY8ZYRJMQ7"
          + "PECSERVERS_poste_url"                            = "https://poc.pagopa.poste.it"
          + "PECSERVER_BASE_PATH"                             = null
          + "PECSERVER_TOKEN_ISSUER"                          = "app-backend.io.italia.it"
          + "PECSERVER_TOKEN_SECRET"                          = (sensitive value)
          + "PECSERVER_URL"                                   = "https://poc.pagopa.poste.it"
          + "PN_ACTIVATION_BASE_PATH"                         = "/api/v1/pn"
          + "PN_API_KEY"                                      = (sensitive value)
          + "PN_API_KEY_UAT"                                  = (sensitive value)
          + "PN_API_URL"                                      = "https://api-io.notifichedigitali.it"
          + "PN_API_URL_UAT"                                  = "https://api-io.uat.notifichedigitali.it"
          + "PN_CONFIGURATION_ID"                             = "01HMVMHCZZ8D0VTFWMRHBM5D6F"
          + "PN_SERVICE_ID"                                   = "01G40DWQGKY5GRWSNM4303VNRP"
          + "PUSH_NOTIFICATIONS_QUEUE_NAME"                   = "push-notifications"
          + "PUSH_NOTIFICATIONS_STORAGE_CONNECTION_STRING"    = (sensitive value)
          + "REDIS_PASSWORD"                                  = (sensitive value)
          + "REDIS_PORT"                                      = (sensitive value)
          + "REDIS_URL"                                       = (sensitive value)
          + "SERVICES_APP_BACKEND_API_BASE_PATH"              = "/api/v1"
          + "SERVICES_APP_BACKEND_API_URL"                    = "https://io-p-itn-svc-app-be-func-01.azurewebsites.net"
          + "SERVICES_APP_BACKEND_BASE_PATH"                  = "/api/v2"
          + "TEST_CGN_FISCAL_CODES"                           = null
          + "THIRD_PARTY_CONFIG_LIST"                         = (sensitive value)
          + "TRIAL_SYSTEM_APIM_BASE_PATH"                     = "/manage/api/v1"
          + "TRIAL_SYSTEM_APIM_KEY"                           = (sensitive value)
          + "TRIAL_SYSTEM_APIM_URL"                           = "https://ts-p-itn-apim-01.azure-api.net"
          + "TRIAL_SYSTEM_API_BASE_PATH"                      = "/api/v1"
          + "TRIAL_SYSTEM_API_KEY"                            = (sensitive value)
          + "TRIAL_SYSTEM_API_URL"                            = "https://ts-p-itn-api-func-01.azurewebsites.net"
          + "UNIQUE_EMAIL_ENFORCEMENT_USERS"                  = (sensitive value)
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_HEALTHCHECK_MAXUNHEALTHYWORKERPERCENT"   = "95"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "westeurope"
      + name                                           = "io-p-app-appbackendl3"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "io-p-rg-linux"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + virtual_network_backup_restore_enabled         = false
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_command_line                        = "npm run start"
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/ping"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = (known after apply)
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version = "20-lts"
            }

          + auto_heal_setting {
              + action {
                  + action_type                    = "Recycle"
                  + minimum_process_execution_time = "00:05:00"
                }
              + trigger {
                  + slow_request {
                      + count      = 50
                      + interval   = "00:01:00"
                      + time_taken = "00:00:10"
                    }
                }
            }

          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-services-snet-1"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-services-snet-2"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-appgateway-snet"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-apim-snet-01"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-platform-api-gateway-snet-01"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-agw-snet-01"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-services-snet-1"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-services-snet-2"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-appgateway-snet"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-apim-snet-01"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-platform-api-gateway-snet-01"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-agw-snet-01"
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.96/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.112/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.128/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.144/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.160/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.176/28"
              + name       = "rule"
              + priority   = 65000
            }
        }

      + sticky_settings {
          + app_setting_names = [
              + "APPINSIGHTS_CLOUD_ROLE_NAME",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
            ]
        }
    }

  # module.app_backend_weu["3"].module.appservice_app_backend.azurerm_service_plan.this[0] will be created
  + resource "azurerm_service_plan" "this" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "westeurope"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "io-p-plan-appappbackendl3"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = true
      + reserved                        = (known after apply)
      + resource_group_name             = "io-p-rg-linux"
      + sku_name                        = "P1v3"
      + tags                            = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + worker_count                    = (known after apply)
      + zone_balancing_enabled          = false
    }

  # module.app_backend_weu["3"].module.appservice_app_backend_slot_staging.azurerm_app_service_slot_virtual_network_swift_connection.app_service_virtual_network_swift_connection[0] will be created
  + resource "azurerm_app_service_slot_virtual_network_swift_connection" "app_service_virtual_network_swift_connection" {
      + app_service_id = (known after apply)
      + id             = (known after apply)
      + slot_name      = "staging"
      + subnet_id      = (known after apply)
    }

  # module.app_backend_weu["3"].module.appservice_app_backend_slot_staging.azurerm_linux_web_app_slot.this will be created
  + resource "azurerm_linux_web_app_slot" "this" {
      + app_metadata                                   = (known after apply)
      + app_service_id                                 = (known after apply)
      + app_settings                                   = {
          + "ALLOW_MYPORTAL_IP_SOURCE_RANGE"                  = (sensitive value)
          + "ALLOW_NOTIFY_IP_SOURCE_RANGE"                    = "127.0.0.0/0"
          + "API_BASE_PATH"                                   = "/api/v1"
          + "API_KEY"                                         = (sensitive value)
          + "API_URL"                                         = "https://io-p-itn-auth-profile-func-02.azurewebsites.net/api/v1"
          + "APPINSIGHTS_CLOUD_ROLE_NAME"                     = "io-p-app-appbackendl3-staging"
          + "APPINSIGHTS_CONNECTION_STRING"                   = (sensitive value)
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = (sensitive value)
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "100"
          + "APP_MESSAGES_API_KEY"                            = (sensitive value)
          + "APP_MESSAGES_API_URL"                            = "https://io-p-itn-com-citizen-func-01.azurewebsites.net/api/v1"
          + "AUTHENTICATION_BASE_PATH"                        = null
          + "BONUS_API_BASE_PATH"                             = "/api/v1"
          + "BONUS_API_KEY"                                   = "to-remove"
          + "BONUS_API_URL"                                   = "to-remove"
          + "CGN_API_BASE_PATH"                               = "/api/v1/cgn"
          + "CGN_API_KEY"                                     = (sensitive value)
          + "CGN_API_URL"                                     = "https://io-p-itn-cgn-card-func-02.azurewebsites.net"
          + "CGN_OPERATOR_SEARCH_API_BASE_PATH"               = "/api/v1/cgn/operator-search"
          + "CGN_OPERATOR_SEARCH_API_KEY"                     = (sensitive value)
          + "CGN_OPERATOR_SEARCH_API_URL"                     = "https://io-p-itn-cgn-search-func-02.azurewebsites.net"
          + "EUCOVIDCERT_API_BASE_PATH"                       = "/api/v1/eucovidcert"
          + "EUCOVIDCERT_API_KEY"                             = (sensitive value)
          + "EUCOVIDCERT_API_URL"                             = "https://io-p-eucovidcert-fn.azurewebsites.net/api/v1"
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "128"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "FF_BONUS_ENABLED"                                = "1"
          + "FF_CGN_ENABLED"                                  = "1"
          + "FF_EUCOVIDCERT_ENABLED"                          = "1"
          + "FF_IO_FIMS_ENABLED"                              = "1"
          + "FF_IO_SIGN_ENABLED"                              = "1"
          + "FF_IO_WALLET_ENABLED"                            = "1"
          + "FF_IO_WALLET_TRIAL_ENABLED"                      = "0"
          + "FF_IO_X_USER_TOKEN"                              = "NONE"
          + "FF_IO_X_USER_TOKEN_BETA_TESTER_SHA_LIST"         = (sensitive value)
          + "FF_IO_X_USER_TOKEN_CANARY_SHA_USERS_REGEX"       = "XYZ"
          + "FF_PN_ACTIVATION_ENABLED"                        = "1"
          + "FF_ROUTING_PUSH_NOTIF"                           = "ALL"
          + "FF_ROUTING_PUSH_NOTIF_BETA_TESTER_SHA_LIST"      = (sensitive value)
          + "FF_ROUTING_PUSH_NOTIF_CANARY_SHA_USERS_REGEX"    = "^([(0-9)|(a-f)|(A-F)]{63}[(0-4)]{1})$"
          + "FF_TRIAL_SYSTEM_ENABLED"                         = "1"
          + "FF_UNIQUE_EMAIL_ENFORCEMENT"                     = "ALL"
          + "IO_FIMS_API_BASE_PATH"                           = "/api/v1/fims"
          + "IO_FIMS_API_KEY"                                 = (sensitive value)
          + "IO_FIMS_API_URL"                                 = "https://io-p-itn-fims-user-func-01.azurewebsites.net"
          + "IO_SIGN_API_BASE_PATH"                           = "/api/v1/sign"
          + "IO_SIGN_API_KEY"                                 = (sensitive value)
          + "IO_SIGN_API_URL"                                 = "https://io-p-sign-user-func.azurewebsites.net"
          + "IO_SIGN_SERVICE_ID"                              = "01GQQZ9HF5GAPRVKJM1VDAVFHM"
          + "IO_WALLET_API_BASE_PATH"                         = "/api/v1/wallet"
          + "IO_WALLET_API_KEY"                               = (sensitive value)
          + "IO_WALLET_API_URL"                               = "https://io-p-itn-wallet-user-func-02.azurewebsites.net"
          + "IO_WALLET_TRIAL_ID"                              = "01J2GN4TA8FB6DPTAX3T3YD6M1"
          + "IO_WALLET_UAT_API_BASE_PATH"                     = "/api/v1/wallet/uat"
          + "IO_WALLET_UAT_API_KEY"                           = (sensitive value)
          + "IO_WALLET_UAT_API_URL"                           = "https://io-u-itn-wallet-user-func-01.azurewebsites.net/api/v1/wallet"
          + "JWT_SUPPORT_TOKEN_EXPIRATION"                    = "1209600"
          + "JWT_SUPPORT_TOKEN_ISSUER"                        = "app-backend.io.italia.it"
          + "JWT_SUPPORT_TOKEN_PRIVATE_RSA_KEY"               = (sensitive value)
          + "LOLLIPOP_API_BASE_PATH"                          = "/api/v1"
          + "LOLLIPOP_API_KEY"                                = (sensitive value)
          + "LOLLIPOP_API_URL"                                = "https://io-p-itn-auth-lollipop-func-02.azurewebsites.net"
          + "MYPORTAL_BASE_PATH"                              = "/myportal/api/v1"
          + "NODE_ENV"                                        = "production"
          + "NOTIFICATIONS_QUEUE_NAME"                        = "push-notifications"
          + "NOTIFICATIONS_STORAGE_CONNECTION_STRING"         = (sensitive value)
          + "PAGOPA_API_KEY_PROD"                             = (sensitive value)
          + "PAGOPA_API_KEY_UAT"                              = (sensitive value)
          + "PAGOPA_API_URL_PROD"                             = "https://api.platform.pagopa.it/checkout/auth/payments/v1"
          + "PAGOPA_API_URL_TEST"                             = "https://api.uat.platform.pagopa.it/checkout/auth/payments/v1"
          + "PAGOPA_ECOMMERCE_API_KEY"                        = (sensitive value)
          + "PAGOPA_ECOMMERCE_BASE_URL"                       = "https://api.platform.pagopa.it/ecommerce/payment-requests-service/v1"
          + "PAGOPA_ECOMMERCE_UAT_API_KEY"                    = (sensitive value)
          + "PAGOPA_ECOMMERCE_UAT_BASE_URL"                   = "https://api.uat.platform.pagopa.it/ecommerce/payment-requests-service/v1"
          + "PECSERVERS_aruba_basePath"                       = "/apigateway/api/v2/pagopa/mailbox"
          + "PECSERVERS_aruba_secret"                         = (sensitive value)
          + "PECSERVERS_aruba_serviceId"                      = "01FRMRD5P7H378MDXBBW3DTYCF"
          + "PECSERVERS_aruba_url"                            = "https://pagopa-test.pec.aruba.it"
          + "PECSERVERS_poste_basePath"                       = null
          + "PECSERVERS_poste_secret"                         = (sensitive value)
          + "PECSERVERS_poste_serviceId"                      = "01FQ4945RG5WJGPHKY8ZYRJMQ7"
          + "PECSERVERS_poste_url"                            = "https://poc.pagopa.poste.it"
          + "PECSERVER_BASE_PATH"                             = null
          + "PECSERVER_TOKEN_ISSUER"                          = "app-backend.io.italia.it"
          + "PECSERVER_TOKEN_SECRET"                          = (sensitive value)
          + "PECSERVER_URL"                                   = "https://poc.pagopa.poste.it"
          + "PN_ACTIVATION_BASE_PATH"                         = "/api/v1/pn"
          + "PN_API_KEY"                                      = (sensitive value)
          + "PN_API_KEY_UAT"                                  = (sensitive value)
          + "PN_API_URL"                                      = "https://api-io.notifichedigitali.it"
          + "PN_API_URL_UAT"                                  = "https://api-io.uat.notifichedigitali.it"
          + "PN_CONFIGURATION_ID"                             = "01HMVMHCZZ8D0VTFWMRHBM5D6F"
          + "PN_SERVICE_ID"                                   = "01G40DWQGKY5GRWSNM4303VNRP"
          + "PUSH_NOTIFICATIONS_QUEUE_NAME"                   = "push-notifications"
          + "PUSH_NOTIFICATIONS_STORAGE_CONNECTION_STRING"    = (sensitive value)
          + "REDIS_PASSWORD"                                  = (sensitive value)
          + "REDIS_PORT"                                      = (sensitive value)
          + "REDIS_URL"                                       = (sensitive value)
          + "SERVICES_APP_BACKEND_API_BASE_PATH"              = "/api/v1"
          + "SERVICES_APP_BACKEND_API_URL"                    = "https://io-p-itn-svc-app-be-func-01.azurewebsites.net"
          + "SERVICES_APP_BACKEND_BASE_PATH"                  = "/api/v2"
          + "TEST_CGN_FISCAL_CODES"                           = null
          + "THIRD_PARTY_CONFIG_LIST"                         = (sensitive value)
          + "TRIAL_SYSTEM_APIM_BASE_PATH"                     = "/manage/api/v1"
          + "TRIAL_SYSTEM_APIM_KEY"                           = (sensitive value)
          + "TRIAL_SYSTEM_APIM_URL"                           = "https://ts-p-itn-apim-01.azure-api.net"
          + "TRIAL_SYSTEM_API_BASE_PATH"                      = "/api/v1"
          + "TRIAL_SYSTEM_API_KEY"                            = (sensitive value)
          + "TRIAL_SYSTEM_API_URL"                            = "https://ts-p-itn-api-func-01.azurewebsites.net"
          + "UNIQUE_EMAIL_ENFORCEMENT_USERS"                  = (sensitive value)
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_HEALTHCHECK_MAXUNHEALTHYWORKERPERCENT"   = "95"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "staging"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + virtual_network_backup_restore_enabled         = false
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_command_line                        = "npm run start"
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/ping"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = (known after apply)
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version = "20-lts"
            }

          + auto_heal_setting {
              + action {
                  + action_type                    = "Recycle"
                  + minimum_process_execution_time = "00:05:00"
                }
              + trigger {
                  + slow_request {
                      + count      = 50
                      + interval   = "00:01:00"
                      + time_taken = "00:00:10"
                    }
                }
            }

          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/azure-devops"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-services-snet-1"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-services-snet-2"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-appgateway-snet"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-apim-snet-01"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-platform-api-gateway-snet-01"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-github-runner-snet-01"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-agw-snet-01"
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.96/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.112/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.128/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.144/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.160/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.176/28"
              + name       = "rule"
              + priority   = 65000
            }
        }
    }

  # module.application_gateway_weu.module.app_gw.azurerm_application_gateway.this will be updated in-place
  ~ resource "azurerm_application_gateway" "this" {
        id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway"
        name                              = "io-p-appgateway"
        tags                              = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (8 unchanged attributes hidden)

      - global {
          - request_buffering_enabled  = true -> null
          - response_buffering_enabled = false -> null
        }

      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (97 unchanged blocks hidden)
    }

  # module.function_app_services.module.function_services_dx.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            # (61 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Web/sites/io-p-itn-funcsvc-func-01"
        name                                           = "io-p-itn-funcsvc-func-01"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Platform"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "2.0.2"
            "Source"                                 = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_app_services.module.function_services_dx.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            # (61 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Web/sites/io-p-itn-funcsvc-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "2.0.2"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_app_services.module.function_services_dx.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Insights/metricAlerts/[io-p-itn-funcsvc-func-01] Health Check Failed"
        name                     = "[io-p-itn-funcsvc-func-01] Health Check Failed"
        tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "2.0.2"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_app_services.module.function_services_dx.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitnfuncsvcstfn01] Low Availability"
        name                     = "[iopitnfuncsvcstfn01] Low Availability"
        tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "2.0.2"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_app_services.module.services_storage_account.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitnfuncsvcst01] Low Availability"
        name                     = "[iopitnfuncsvcst01] Low Availability"
      ~ tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "1.0.0" -> "1.0.1"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_app_services.module.services_storage_account.azurerm_private_endpoint.this["blob"] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-funcsvc-blob-pep-01"
        name                          = "io-p-itn-funcsvc-blob-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "1.0.0" -> "1.0.1"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_app_services.module.services_storage_account.azurerm_private_endpoint.this["queue"] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-funcsvc-queue-pep-01"
        name                          = "io-p-itn-funcsvc-queue-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "1.0.0" -> "1.0.1"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_app_services.module.services_storage_account.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfuncsvcst01"
        name                               = "iopitnfuncsvcst01"
      ~ tags                               = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "1.0.0" -> "1.0.1"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
        name                          = "io-p-itn-platform-api-gateway-apim-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.2.2"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (21 unchanged attributes hidden)

      ~ hostname_configuration {
          ~ proxy {
              ~ default_ssl_binding             = true -> false
                # (12 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (8 unchanged blocks hidden)
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.data.azurerm_private_dns_zone.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.servicebus.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-evt-rg"
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.azurerm_private_endpoint.service_bus_pep[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "service_bus_pep" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01"
        name                          = "io-p-itn-platform-sbns-pep-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_service_bus_namespace"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "0.0.4"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (7 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01/privateDnsZoneGroups/private-dns-zone-group"
            name                 = "private-dns-zone-group"
          ~ private_dns_zone_ids = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-evt-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ] -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 20 to add, 15 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.apim_itn.module.apim.azurerm_api_management.this,
  on .terraform/modules/apim_itn.apim/main.tf line 18, in resource "azurerm_api_management" "this":
  18: resource "azurerm_api_management" "this" {

`key_vault_id` has been deprecated in favour of `key_vault_certificate_id`
and will be removed in v5.0 of the AzureRM provider

(and 23 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
